system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
      ( -0.2 -1.5 0.0)
      ( 7.0 -1.5 0.0)
      (7.0 1.5 0.0)
      ( -0.2 1.5 0.0)
      ( -0.2 -1.5 1.2)
      ( 7.0 -1.5 1.2)
      ( 7.0 1.5 1.2)
      ( -0.2 1.5 1.2)
);

blocks
(
    hex ( 0 1 2 3 4 5 6 7)( 40 16 8) simpleGrading ( 1 1 1)
);

edges
(
);

boundary
(
    topAndBottom
    {
        type patch;
        faces
        (
        (3 7 6 2)
	    (1 5 4 0)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    front
    {
        type patch;
        faces
        (
        	(4 5 6 7)
        );
    }

    symmetry
    {
        type symmetryPlane;
        faces
        (
        	(0 3 2 1)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
