0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (564 0 0);

boundaryField
{

    inlet
    {
        type            freestream;
        freestreamValue           $internalField;
    }

    outlet
    {
	type            zeroGradient;
    }

    front
    {
        type            freestream;
        freestreamValue           $internalField;
    }

    symmetry
    {
    	type            symmetryPlane; 
    }

        topAndBottom
    {
        type            freestream;
        freestreamValue           $internalField;
    }

    coneCylinder
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

   /* nozzle
    {
        type            fixedValue;
        value           uniform (0 0 -800);
    }*/



}

// ************************************************************************* //
