0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue           101325;
    }

    outlet
    {
	type            zeroGradient;
    }

    front
    {
        type            freestream;
        freestreamValue           101325;
    }

    symmetry
    {
    	type            symmetryPlane; 
    }

    topAndBottom
    {
        type            freestream;
        freestreamValue           101325;
    }

    coneCylinder
    {
	type            zeroGradient;
    }


   /* nozzle
    {
    type            fixedValue;
	value uniform 101325;
    }*/

}

// ************************************************************************* //
