0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 123.32;

boundaryField
{


    inlet
    {
        type            freestream;
     //   inletValue      $internalField;
        freestreamValue           $internalField;
    }


    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    bottom
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    front
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    symmetry
    {
    	type            symmetryPlane; 
    } 

    topAndBottom
    {
        type            fixedValue;
        value            $internalField;
    }

    coneCylinder
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    /*nozzle
    {
        type            freestream;
      //  inletValue      $internalField;
        freestreamValue           $internalField;
    }*/

}


// ************************************************************************* //
