0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{


    inlet
    {
         type            freestream;
	freestreamValue 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    front
    {
        type            calculated;
        value           uniform 0;
    }

    symmetry
    {
    	type            symmetryPlane; 
    } 

    topAndBottom
    {
        type            calculated;
        value           uniform 0;
    }

    coneCylinder
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    /*nozzle
    {
        type            calculated;
        value           uniform 0;
    }*/




}


// ************************************************************************* //
